In [ ]:
## Project By Nathan Palmer 12/14/23

In [1]:
%load_ext sql
import os
import configparser
import pandas as pd
from sqlalchemy import create_engine
import sqlalchemy.sql

In [2]:
mysqlcfg = configparser.ConfigParser()
mysqlcfg.read("/home/jovyan/3287/mysql.cfg")
dburl = mysqlcfg['mysql']['url']

os.environ['DATABASE_URL'] = dburl  # define this env. var for sqlmagic
eng = create_engine(dburl)
conn = eng.connect()

In [3]:
%reload_ext sql
print ("get version...")
%sql SELECT version()

get version...
1 rows affected.

[('8.0.33',)]

In [4]:
def convertSQL(table):
    # Read the CSV file into a pandas DataFrame
    csv_file_path = table + '.csv'
    df = pd.read_csv(csv_file_path)

    # Write to an SQL table
    table_name = table
    df.to_sql(table_name, conn, index=False, if_exists='fail')

In [5]:
'''%%sql
ALTER TABLE Career_Stats_Passing
DROP FOREIGN KEY fk_career_stats_passing_player_id;'''

'%%sql\nALTER TABLE Career_Stats_Passing\nDROP FOREIGN KEY fk_career_stats_passing_player_id;'

In [6]:
'''This SQL script is used to delete a series of specified tables, such as 'Basic_Stats', 'Career_Stats_Passing', and others, from a database if they exist, likely as part of a database cleanup or restructuring process.'''

"This SQL script is used to delete a series of specified tables, such as 'Basic_Stats', 'Career_Stats_Passing', and others, from a database if they exist, likely as part of a database cleanup or restructuring process."

In [7]:
%%sql
DROP TABLE IF EXISTS Basic_Stats;
DROP TABLE IF EXISTS Career_Stats_Passing;
DROP TABLE IF EXISTS Career_Stats_Defensive;
DROP TABLE IF EXISTS Career_Stats_Receiving;
DROP TABLE IF EXISTS Game_Logs_Quarterback;
DROP TABLE IF EXISTS InsertionLog;
DROP TABLE IF EXISTS trg_cascade_delete_passing_stats;
DROP TABLE IF EXISTS idx_nfl_players;
DROP TABLE IF EXISTS fk_career_stats_passing_player_id;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.

[]

In [8]:
'''This code iterates through a list of table names, attempting to execute the convertSQL function on each, and prints a message if a ValueError occurs, indicating that the table already exists.'''

'This code iterates through a list of table names, attempting to execute the convertSQL function on each, and prints a message if a ValueError occurs, indicating that the table already exists.'

In [9]:
tables = [
    'Basic_Stats',
    'Career_Stats_Passing',
    'Career_Stats_Defensive',
    'Career_Stats_Receiving',
    'Game_Logs_Quarterback'
    
]

for t in tables:
    try:
        convertSQL(t)
    except ValueError:
        print("table", t, "exists")

In [10]:
#chunk_size = 10000
#csv_file_path = 'tracking_week_9.csv'

#for chunk in pd.read_csv(csv_file_path, chunksize=chunk_size, quoting=3, escapechar="\\"):
#    chunk.to_sql('tracking_week_9', conn, if_exists='append', index=False)

In [11]:
'''This is a series of SQL query for data retrieval, where it selects and displays a limited number of records from a specified database table, typically for data inspection or analysis purposes.'''

'This is a series of SQL query for data retrieval, where it selects and displays a limited number of records from a specified database table, typically for data inspection or analysis purposes.'

In [12]:
%%sql
SELECT *
FROM Basic_Stats
LIMIT 2;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
2 rows affected.

[(None, 'Grand Rapids , MI', '5/23/1921', 'Notre Dame', 'Retired', None, '3 Seasons', 71.0, None, None, 'Evans, Fred', None, 'fredevans/2513736', None, 185.0, '1946 - 1948'),
 (None, 'Dayton , OH', '12/21/1930', 'Dayton', 'Retired', None, '1 Season', 70.0, None, None, 'Raiff, Jim', None, 'jimraiff/2523700', None, 235.0, '1954 - 1954')]

In [13]:
%%sql
SELECT *
FROM Career_Stats_Passing
LIMIT 2;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
2 rows affected.

[('tomfarris/2513861', 'Farris, Tom', None, 1948, 'Chicago Rockets', 0, '--', '--', '--', 0.0, '--', '--', '--', '--', '--', '--', '--', '--', '--', '--', '--', '--', 0.0),
 ('tomfarris/2513861', 'Farris, Tom', None, 1947, 'Chicago Bears', 9, '2', '0', '0.0', 0.2, '0', '0.0', '0.0', '0', '0.0', '0', '0.0', '--', '0', '0', '0', '0', 39.6)]

In [14]:
%%sql
SELECT *
FROM Career_Stats_Defensive
LIMIT 2;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
2 rows affected.

[('quinnjohnson/79593', 'Johnson, Quinn', None, 2013, 'Tennessee Titans', 4, '0', '--', '--', '--', '--', '--', '--', '--', '--', 0.0, '--'),
 ('quinnjohnson/79593', 'Johnson, Quinn', None, 2012, 'Tennessee Titans', 16, '1', '1', '0', '0.0', '--', '0', '--', '--', '--', 0.0, '--')]

In [15]:
%%sql
SELECT *
FROM Career_Stats_Receiving
LIMIT 2;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
2 rows affected.

[('fredevans/2513736', 'Evans, Fred', None, 1948, 'Chicago Bears', 3, '1', '-2', '-2.0', -0.7, '--', '0', '--', '--', '--', '--'),
 ('fredevans/2513736', 'Evans, Fred', None, 1948, 'Chicago Rockets', 0, '--', '--', '--', 0.0, '--', '--', '--', '--', '--', '--')]

In [16]:
%%sql
SELECT *
FROM Game_Logs_Quarterback
LIMIT 2;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
2 rows affected.

[('jaredzabransky/2495791', 'Zabransky, Jared', None, 2007, 'Preseason', 1, '08/11', 'Home', 'CHI', 'L', '19 to 20', 0, '0', '--', '--', '--', '--', '--', '--', '--', '--', '--', 0.0, '--', '--', '--', '--', '--', '--'),
 ('jaredzabransky/2495791', 'Zabransky, Jared', None, 2007, 'Preseason', 2, '08/18', 'Away', 'ARI', 'W', '33 to 20', 1, '0', '1', '4', '25.0', '19', '4.8', '0', '0', '0', '0', 46.9, '--', '--', '--', '--', '--', '--')]

In [17]:
'''This SQL query selects the names and sum of 'Total Tackles' from the 'Career_Stats_Defensive' table, groups the results by player name, orders them in descending order of total tackles, and limits the output to the top 10 records.'''

"This SQL query selects the names and sum of 'Total Tackles' from the 'Career_Stats_Defensive' table, groups the results by player name, orders them in descending order of total tackles, and limits the output to the top 10 records."

In [18]:
%%sql
SELECT Name, SUM(`Total Tackles`) AS TotalTackles
FROM Career_Stats_Defensive
GROUP BY Name
ORDER BY TotalTackles DESC
LIMIT 10;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
10 rows affected.

[('Fletcher, London', 1796.0),
 ('Lewis, Ray', 1336.0),
 ('Dansby, Karlos', 1322.0),
 ('Urlacher, Brian', 1229.0),
 ('Farrior, James', 1220.0),
 ("Jackson, D'Qwell", 1190.0),
 ('Posluszny, Paul', 1153.0),
 ('Johnson, Derrick', 1123.0),
 ('Greenway, Chad', 1101.0),
 ('Harris, David', 1087.0)]

In [19]:
'''This SQL query retrieves the names and the sum of 'Games Played' for each player from the 'Game_Logs_Quarterback' table, groups the results by player name, sorts them in descending order based on total games played, and displays the top 10 entries.'''

"This SQL query retrieves the names and the sum of 'Games Played' for each player from the 'Game_Logs_Quarterback' table, groups the results by player name, sorts them in descending order based on total games played, and displays the top 10 entries."

In [20]:
%%sql
SELECT Name, SUM(`Games Played`) AS TotalGamesPlayed
FROM Game_Logs_Quarterback
GROUP BY Name
ORDER BY TotalGamesPlayed DESC
LIMIT 10;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
10 rows affected.

[('Favre, Brett', Decimal('348')),
 ('Manning, Peyton', Decimal('331')),
 ('Brady, Tom', Decimal('306')),
 ('Brees, Drew', Decimal('291')),
 ('Marino, Dan', Decimal('262')),
 ('Hasselbeck, Matt', Decimal('260')),
 ('Elway, John', Decimal('258')),
 ('Manning, Eli', Decimal('255')),
 ('Testaverde, Vinny', Decimal('247')),
 ('Roethlisberger, Ben', Decimal('241'))]

In [21]:
'''This SQL query calculates the sum of 'Receptions' for each team in the 'Career_Stats_Receiving' table, groups the results by team, orders them in descending order of total receptions, and displays the top 10 teams.'''

"This SQL query calculates the sum of 'Receptions' for each team in the 'Career_Stats_Receiving' table, groups the results by team, orders them in descending order of total receptions, and displays the top 10 teams."

In [22]:
%%sql
SELECT Team, SUM(`Receptions`) AS TotalReceptions
FROM Career_Stats_Receiving
GROUP BY Team
ORDER BY TotalReceptions DESC
LIMIT 10;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
10 rows affected.

[('Philadelphia Eagles', 11616.0),
 ('Detroit Lions', 10294.0),
 ('Chicago Bears', 10255.0),
 ('Minnesota Vikings', 10189.0),
 ('Green Bay Packers', 10123.0),
 ('San Diego Chargers', 10094.0),
 ('New York Giants', 9948.0),
 ('Washington Redskins', 9945.0),
 ('Denver Broncos', 9941.0),
 ('San Francisco 49ers', 9845.0)]

In [23]:
'''This SQL query calculates the sum of 'Receptions' for each team in the 'Career_Stats_Receiving' table, groups the results by team, orders them in descending order of total receptions, and displays the top 10 teams.'''

"This SQL query calculates the sum of 'Receptions' for each team in the 'Career_Stats_Receiving' table, groups the results by team, orders them in descending order of total receptions, and displays the top 10 teams."

In [24]:
%%sql
SELECT Team, SUM(`Receptions`) AS TotalReceptions
FROM Career_Stats_Receiving
GROUP BY Team
ORDER BY TotalReceptions DESC
LIMIT 10;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
10 rows affected.

[('Philadelphia Eagles', 11616.0),
 ('Detroit Lions', 10294.0),
 ('Chicago Bears', 10255.0),
 ('Minnesota Vikings', 10189.0),
 ('Green Bay Packers', 10123.0),
 ('San Diego Chargers', 10094.0),
 ('New York Giants', 9948.0),
 ('Washington Redskins', 9945.0),
 ('Denver Broncos', 9941.0),
 ('San Francisco 49ers', 9845.0)]

In [25]:
'''This SQL query aggregates the total 'TD Passes' for each player in the 'Career_Stats_Passing' table, groups the results by player name, sorts them in descending order based on total touchdown passes, and displays the top 10 players.'''

"This SQL query aggregates the total 'TD Passes' for each player in the 'Career_Stats_Passing' table, groups the results by player name, sorts them in descending order based on total touchdown passes, and displays the top 10 players."

In [26]:
%%sql
SELECT Name, SUM(`TD Passes`) AS TotalTDPasses
FROM Career_Stats_Passing
GROUP BY Name
ORDER BY TotalTDPasses DESC
LIMIT 10;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
10 rows affected.

[('Manning, Peyton', 539.0),
 ('Favre, Brett', 508.0),
 ('Brees, Drew', 465.0),
 ('Brady, Tom', 456.0),
 ('Marino, Dan', 420.0),
 ('Tarkenton, Fran', 342.0),
 ('Manning, Eli', 320.0),
 ('Rivers, Philip', 314.0),
 ('Roethlisberger, Ben', 301.0),
 ('Elway, John', 300.0)]

In [27]:
'''This SQL query joins the 'Basic_Stats' and 'Career_Stats_Passing' tables on the player ID, calculates the total 'TD Passes' for each college, groups the results by college, orders them in descending order based on total touchdown passes, and displays the top 20 colleges.'''

"This SQL query joins the 'Basic_Stats' and 'Career_Stats_Passing' tables on the player ID, calculates the total 'TD Passes' for each college, groups the results by college, orders them in descending order based on total touchdown passes, and displays the top 20 colleges."

In [28]:
%%sql
SELECT bs.College, SUM(csp.`TD Passes`) AS TotalTDPasses
FROM Basic_Stats bs
JOIN Career_Stats_Passing csp ON bs.`Player Id` = csp.`Player Id`
GROUP BY bs.College
ORDER BY TotalTDPasses DESC
LIMIT 20;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
20 rows affected.

[('Purdue', 1230.0),
 ('USC', 976.0),
 ('Miami (Fla.)', 720.0),
 ('Michigan', 668.0),
 ('Oregon', 638.0),
 ('Georgia', 615.0),
 ('UCLA', 599.0),
 ('Boston College', 578.0),
 ('Tennessee', 574.0),
 ('North Carolina State', 548.0),
 ('Stanford', 540.0),
 ('California', 528.0),
 ('Southern Mississippi', 522.0),
 ('Mississippi', 497.0),
 ('Maryland', 495.0),
 ('Pittsburgh', 479.0),
 ('Notre Dame', 441.0),
 ('San Jose State', 405.0),
 ('Texas Christian', 381.0),
 ('Delaware', 374.0)]

In [29]:
'''This SQL command alters the 'Basic_Stats' table to add a primary key constraint to the 'Player Id' column, with a maximum length of 255 characters for the key.'''

"This SQL command alters the 'Basic_Stats' table to add a primary key constraint to the 'Player Id' column, with a maximum length of 255 characters for the key."

In [30]:
%%sql
ALTER TABLE Basic_Stats
ADD PRIMARY KEY (`Player Id`(255));

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
0 rows affected.

[]

In [31]:
'''This SQL command alters the 'Career_Stats_Passing' table by adding a foreign key constraint named 'fk_player_id' on the 'Player Id' column, which references the 'Player Id' column in the 'Basic_Stats' table, establishing a relational link between the two tables.'''

"This SQL command alters the 'Career_Stats_Passing' table by adding a foreign key constraint named 'fk_player_id' on the 'Player Id' column, which references the 'Player Id' column in the 'Basic_Stats' table, establishing a relational link between the two tables."

In [32]:
'''%%sql
ALTER TABLE Career_Stats_Passing
ADD CONSTRAINT fk_player_id
FOREIGN KEY (`Player Id`) 
REFERENCES Basic_Stats(`Player Id`);
'''

'%%sql\nALTER TABLE Career_Stats_Passing\nADD CONSTRAINT fk_player_id\nFOREIGN KEY (`Player Id`) \nREFERENCES Basic_Stats(`Player Id`);\n'

In [33]:
'''%%sql
ALTER TABLE Basic_Stats
MODIFY COLUMN `Player Id` VARCHAR(255);

ALTER TABLE Career_Stats_Passing
MODIFY COLUMN `Player Id` VARCHAR(255);

ALTER TABLE Career_Stats_Passing
ADD CONSTRAINT fk_career_stats_passing_player_id
FOREIGN KEY (`Player Id`) REFERENCES Basic_Stats(`Player Id`);'''

'%%sql\nALTER TABLE Basic_Stats\nMODIFY COLUMN `Player Id` VARCHAR(255);\n\nALTER TABLE Career_Stats_Passing\nMODIFY COLUMN `Player Id` VARCHAR(255);\n\nALTER TABLE Career_Stats_Passing\nADD CONSTRAINT fk_career_stats_passing_player_id\nFOREIGN KEY (`Player Id`) REFERENCES Basic_Stats(`Player Id`);'

In [34]:
'''%%sql
ALTER TABLE Career_Stats_Passing
ADD CONSTRAINT fk_career_stats_passing_player_id
FOREIGN KEY (`Player Id`) REFERENCES Basic_Stats(`Player Id`);'''

'%%sql\nALTER TABLE Career_Stats_Passing\nADD CONSTRAINT fk_career_stats_passing_player_id\nFOREIGN KEY (`Player Id`) REFERENCES Basic_Stats(`Player Id`);'

In [35]:
'''This SQL command creates an index named 'idx_nfl_players' on the 'Name' column (with a maximum length of 255 characters) of the 'Basic_Stats' table, to improve the performance of queries involving this column.'''

"This SQL command creates an index named 'idx_nfl_players' on the 'Name' column (with a maximum length of 255 characters) of the 'Basic_Stats' table, to improve the performance of queries involving this column."

In [36]:
%%sql
CREATE INDEX idx_nfl_players
ON Basic_Stats (Name(255));

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
0 rows affected.

[]

In [37]:
'''This SQL command creates a trigger named 'trg_cascade_delete_passing_stats' on the 'Basic_Stats' table, which, before each row deletion, automatically deletes corresponding rows in the 'Career_Stats_Passing' table where the 'Player Id' matches the one being deleted in 'Basic_Stats'.'''

"This SQL command creates a trigger named 'trg_cascade_delete_passing_stats' on the 'Basic_Stats' table, which, before each row deletion, automatically deletes corresponding rows in the 'Career_Stats_Passing' table where the 'Player Id' matches the one being deleted in 'Basic_Stats'."

In [38]:
%%sql
CREATE TRIGGER trg_cascade_delete_passing_stats
BEFORE DELETE ON Basic_Stats FOR EACH ROW
BEGIN
    DELETE FROM Career_Stats_Passing WHERE `Player Id` = OLD.`Player Id`;
END

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
0 rows affected.

[]

In [39]:
'''This SQL command deletes the row(s) from the 'Basic_Stats' table where the 'Player Id' column matches the value 'danmarino/2501869'.'''

"This SQL command deletes the row(s) from the 'Basic_Stats' table where the 'Player Id' column matches the value 'danmarino/2501869'."

In [40]:
%%sql
DELETE FROM Basic_Stats WHERE `Player Id` = 'danmarino/2501869';

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
1 rows affected.

[]

In [41]:
'''This SQL query calculates the sum of 'TD Passes' for each player in the 'Career_Stats_Passing' table, groups the results by player name, sorts them in descending order based on total touchdown passes, and displays the top 10 players.'''

"This SQL query calculates the sum of 'TD Passes' for each player in the 'Career_Stats_Passing' table, groups the results by player name, sorts them in descending order based on total touchdown passes, and displays the top 10 players."

In [42]:
%%sql
SELECT Name, SUM(`TD Passes`) AS TotalTDPasses
FROM Career_Stats_Passing
GROUP BY Name
ORDER BY TotalTDPasses DESC
LIMIT 10;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
10 rows affected.

[('Manning, Peyton', 539.0),
 ('Favre, Brett', 508.0),
 ('Brees, Drew', 465.0),
 ('Brady, Tom', 456.0),
 ('Tarkenton, Fran', 342.0),
 ('Manning, Eli', 320.0),
 ('Rivers, Philip', 314.0),
 ('Roethlisberger, Ben', 301.0),
 ('Elway, John', 300.0),
 ('Rodgers, Aaron', 297.0)]

In [43]:
'''This SQL command creates a new table named 'InsertionLog' with three columns: 'LogId' as an auto-incrementing integer and the primary key, 'Player Id' as an integer, and 'InsertionTime' as a datetime field to record the time of data insertion.'''

"This SQL command creates a new table named 'InsertionLog' with three columns: 'LogId' as an auto-incrementing integer and the primary key, 'Player Id' as an integer, and 'InsertionTime' as a datetime field to record the time of data insertion."

In [44]:
%%sql
CREATE TABLE InsertionLog (
    LogId INT AUTO_INCREMENT PRIMARY KEY,
    `Player Id` INT,
    InsertionTime DATETIME
);

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
0 rows affected.

[]

In [45]:
'''This SQL command creates a trigger named 'trg_after_insert_basic_stats' on the 'Basic_Stats' table, which, after each row is inserted, automatically adds a new record into the 'InsertionLog' table with the new 'Player Id' and the current timestamp.'''

"This SQL command creates a trigger named 'trg_after_insert_basic_stats' on the 'Basic_Stats' table, which, after each row is inserted, automatically adds a new record into the 'InsertionLog' table with the new 'Player Id' and the current timestamp."

In [46]:
%%sql
CREATE TRIGGER trg_after_insert_basic_stats
AFTER INSERT ON Basic_Stats
FOR EACH ROW
BEGIN
    INSERT INTO InsertionLog (`Player Id`, InsertionTime)
    VALUES (NEW.`Player Id`, NOW());
END;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
0 rows affected.

[]

In [47]:
'''This SQL command inserts a new row into the 'Basic_Stats' table with a 'Player Id' of 1234567 and a Name value of 'natepalmer'.'''

"This SQL command inserts a new row into the 'Basic_Stats' table with a 'Player Id' of 1234567 and a Name value of 'natepalmer'."

In [48]:
%%sql
INSERT INTO Basic_Stats (`Player Id`, Name) VALUES (1234567, 'natepalmer');

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
1 rows affected.

[]

In [49]:
'''This SQL query retrieves all columns from the 'Basic_Stats' table for the row where the 'Player Id' column has the value 1234567. It shows the evidence of the insertion working.'''

"This SQL query retrieves all columns from the 'Basic_Stats' table for the row where the 'Player Id' column has the value 1234567. It shows the evidence of the insertion working."

In [50]:
%%sql
SELECT * FROM Basic_Stats WHERE `Player Id` = 1234567;

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
1 rows affected.

[(None, None, None, None, None, None, None, None, None, None, 'natepalmer', None, '1234567', None, None, None)]

In [51]:
'''This SQL command updates the 'Career_Stats_Passing' table, setting the 'TD Passes' value to 30 for all rows where the 'Player Id' matches 'some_player_id'. This is evidence of the update working.'''

"This SQL command updates the 'Career_Stats_Passing' table, setting the 'TD Passes' value to 30 for all rows where the 'Player Id' matches 'some_player_id'. This is evidence of the update working."

In [52]:
%%sql 
UPDATE Career_Stats_Passing
SET `TD Passes` = 30
WHERE `Player Id` = 'some_player_id';

 * mysql://napa8745:***@applied-sql.cs.colorado.edu:3306/napa8745
0 rows affected.

[]

In [53]:
## VIDEO LINK https://youtu.be/uBKEHYBf-yo